{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        ":",
        -2.5565934230898737
      ],
      [
        "s",
        -3.2758034679087746
      ],
      [
        "_",
        -3.364616417276407
      ],
      [
        "the",
        -3.449724267048122
      ],
      [
        "t",
        -3.625558508809698
      ],
      [
        "o",
        -3.6397553723193603
      ],
      [
        "-",
        -3.72813362924631
      ],
      [
        ".",
        -3.729992125376418
      ],
      [
        ",",
        -3.925124183057008
      ],
      [
        "model",
        -3.9295428751528902
      ],
      [
        "'",
        -3.9456055394963894
      ],
      [
        "ing",
        -4.079313138208745
      ],
      [
        "type",
        -4.09176787879435
      ],
      [
        "name",
        -4.095146643206753
      ],
      [
        "prompt",
        -4.102759846350152
      ],
      [
        "shared",
        -4.103265512627793
      ],
      [
        "context",
        -4.103541891757464
      ],
      [
        "purpose",
        -4.103899910187847
      ],
      [
        "problem",
        -4.146943814755211
      ],
      [
        "a",
        -4.150152007111524
      ],
      [
        "n",
        -4.252115892380335
      ],
      [
        "and",
        -4.465950013847143
      ],
      [
        "solution",
        -4.470599993350428
      ],
      [
        "A",
        -4.516136782106003
      ],
      [
        "LLM",
        -4.625459181270079
      ],
      [
        "e",
        -4.691038300737677
      ],
      [
        "if",
        -4.741223223712911
      ],
      [
        "step",
        -4.775050634938955
      ],
      [
        "node",
        -4.783923813113432
      ],
      [
        "verified",
        -4.824540596491357
      ],
      [
        "]",
        -4.881264818422773
      ],
      [
        "ext",
        -4.889116604557131
      ],
      [
        "condition",
        -4.901410129349646
      ],
      [
        "llow",
        -4.906530649064678
      ],
      [
        "acces",
        -4.909277178791642
      ],
      [
        ":[",
        -4.943459477313949
      ],
      [
        "ed",
        -4.97121623466631
      ],
      [
        "al",
        -4.995221956908335
      ],
      [
        "f",
        -5.032687419776371
      ],
      [
        "mathematic",
        -5.047181924448873
      ],
      [
        "start",
        -5.071418097133147
      ],
      [
        "d",
        -5.074888434763542
      ],
      [
        "for",
        -5.1353913396091695
      ],
      [
        "end",
        -5.183958331584629
      ],
      [
        "ly",
        -5.187101476172792
      ],
      [
        "g",
        -5.203701801237113
      ],
      [
        "is",
        -5.229627529301904
      ],
      [
        "pt",
        -5.26410777893091
      ],
      [
        "bo",
        -5.307382900227939
      ],
      [
        "3",
        -5.314752705908585
      ],
      [
        "I",
        -5.320446285138235
      ],
      [
        "or",
        -5.334679018728252
      ],
      [
        "5",
        -5.335705482139415
      ],
      [
        "tur",
        -5.358459513482035
      ],
      [
        "solv",
        -5.466275089528288
      ],
      [
        "To",
        -5.520259359111138
      ],
      [
        "The",
        -5.544617631923035
      ],
      [
        "ure",
        -5.568515143256986
      ],
      [
        "z",
        -5.56885538208261
      ],
      [
        "analysis",
        -5.59562085208292
      ],
      [
        "refinement",
        -5.636510808651369
      ],
      [
        "{",
        -5.684381463585648
      ],
      [
        "i",
        -5.694667177101275
      ],
      [
        "}'",
        -5.733001507798551
      ],
      [
        "further",
        -5.792765201329711
      ],
      [
        "r",
        -5.793310002274463
      ],
      [
        "by",
        -5.803856012504255
      ],
      [
        "process",
        -5.82095969462131
      ],
      [
        "need",
        -5.857215020256342
      ],
      [
        "problems",
        -5.897035752259914
      ],
      [
        "solve",
        -5.914002876829342
      ],
      [
        "in",
        -5.936278949445496
      ],
      [
        "b",
        -5.982595004164905
      ],
      [
        "with",
        -6.031908912878334
      ],
      [
        "Solver",
        -6.09577123361762
      ],
      [
        "his",
        -6.114274483082765
      ],
      [
        "y",
        -6.24438141165113
      ],
      [
        "Thi",
        -6.267197454765036
      ],
      [
        "direct",
        -6.32216524418536
      ],
      [
        "final",
        -6.325696827446805
      ],
      [
        "In",
        -6.3991420648503485
      ],
      [
        "solutions",
        -6.401771766801607
      ],
      [
        "initial",
        -6.408517249371701
      ],
      [
        "refine",
        -6.450417509581044
      ],
      [
        "work",
        -6.481321567580064
      ],
      [
        "m",
        -6.497043035401558
      ],
      [
        "design",
        -6.501111789885413
      ],
      [
        "accuracy",
        -6.508465575305316
      ],
      [
        "found",
        -6.525625051461283
      ],
      [
        "through",
        -6.550614760586455
      ],
      [
        "rom",
        -6.552296588026763
      ],
      [
        "Math",
        -6.561449585845197
      ],
      [
        "an",
        -6.561663424090441
      ],
      [
        "th",
        -6.592902777162545
      ],
      [
        "complex",
        -6.60489965524822
      ],
      [
        "ensur",
        -6.641139671165754
      ],
      [
        "u",
        -6.644632669813173
      ],
      [
        "ther",
        -6.65127061026108
      ],
      [
        "role",
        -6.677889179253899
      ],
      [
        "output",
        -6.681820003052722
      ],
      [
        "E",
        -6.682019855632488
      ],
      [
        "verification",
        -6.68480938530531
      ],
      [
        "p",
        -6.702052180766843
      ],
      [
        "LLM1",
        -6.753679577362393
      ],
      [
        "are",
        -6.781537316040261
      ],
      [
        "ach",
        -6.81190758534465
      ],
      [
        "provide",
        -6.850337506590522
      ],
      [
        "comprehensive",
        -6.857275378499032
      ],
      [
        "base",
        -6.868190922001873
      ],
      [
        "detailed",
        -6.887362230806749
      ],
      [
        "each",
        -6.917003059230134
      ],
      [
        "analyze",
        -6.922750876190099
      ],
      [
        "solved",
        -6.94659038339649
      ],
      [
        "refined",
        -6.958863037834467
      ],
      [
        "required",
        -6.9689258867304105
      ],
      [
        "LLM2",
        -6.98172391568743
      ],
      [
        "correct",
        -7.000886304076522
      ],
      [
        "ch",
        -7.002228116709574
      ],
      [
        "ensure",
        -7.002752790632969
      ],
      [
        "ness",
        -7.005931697735084
      ],
      [
        "approach",
        -7.034386572700222
      ],
      [
        "l",
        -7.048884011046731
      ],
      [
        "whi",
        -7.05734156266413
      ],
      [
        "specialized",
        -7.08876770248936
      ],
      [
        "efor",
        -7.098414690672656
      ],
      [
        "advanced",
        -7.134938956055612
      ],
      [
        "iterative",
        -7.152466282764789
      ],
      [
        "Verification",
        -7.156715546939919
      ],
      [
        "initiate",
        -7.175522935823304
      ],
      [
        "more",
        -7.19374747139877
      ],
      [
        "validation",
        -7.214408086348589
      ],
      [
        "attempt",
        -7.225887144359713
      ],
      [
        "tackle",
        -7.234337106050643
      ],
      [
        "Solution",
        -7.260973796161501
      ],
      [
        "specific",
        -7.26777704179159
      ],
      [
        "ary",
        -7.270353312086912
      ],
      [
        "insight",
        -7.272696110794607
      ],
      [
        "follow",
        -7.273975517013311
      ],
      [
        "necess",
        -7.287774220907311
      ],
      [
        "ies",
        -7.290186883311615
      ],
      [
        "int",
        -7.292819008166261
      ],
      [
        ")",
        -7.301036527289436
      ],
      [
        "4",
        -7.307043501090154
      ],
      [
        "(",
        -7.3217166608909
      ],
      [
        "evaluate",
        -7.3302021357034075
      ],
      [
        "nterim",
        -7.336282349051983
      ],
      [
        "verify",
        -7.339408070387104
      ],
      [
        "LLM3",
        -7.347239364280024
      ],
      [
        "Check",
        -7.355221029530853
      ],
      [
        "interpret",
        -7.366165801773701
      ],
      [
        "effective",
        -7.375188554339472
      ],
      [
        "check",
        -7.377205112392524
      ],
      [
        "graph",
        -7.384933976857284
      ],
      [
        "chain",
        -7.4094062914987715
      ],
      [
        "w",
        -7.413913845737925
      ],
      [
        "thought",
        -7.42876131100674
      ],
      [
        "depth",
        -7.446653273682462
      ],
      [
        "statement",
        -7.464876407662008
      ],
      [
        "its",
        -7.465561877846669
      ],
      [
        "system",
        -7.473022588997717
      ],
      [
        "task",
        -7.4868488930531365
      ],
      [
        "deep",
        -7.496353546679054
      ],
      [
        "collaborative",
        -7.508379678763166
      ],
      [
        "deeper",
        -7.511458998242748
      ],
      [
        "feedback",
        -7.520453377587123
      ],
      [
        "confirm",
        -7.523410937803763
      ],
      [
        "MathSolver",
        -7.533252596739141
      ],
      [
        "requires",
        -7.54609492404734
      ],
      [
        "review",
        -7.562870566064819
      ],
      [
        "you",
        -7.568692348938555
      ],
      [
        "alternative",
        -7.579322439189181
      ],
      [
        "has",
        -7.579467521267784
      ],
      [
        "handle",
        -7.582239323438446
      ],
      [
        "ecision",
        -7.583415167382125
      ],
      [
        "structure",
        -7.5945490379771705
      ],
      [
        "down",
        -7.605516249412621
      ],
      [
        "Verifier",
        -7.609633243634836
      ],
      [
        "determine",
        -7.611684640469688
      ],
      [
        "athSolverLLM",
        -7.613252816291564
      ],
      [
        "stage",
        -7.619542711678413
      ],
      [
        "You",
        -7.622817319904407
      ],
      [
        "pass",
        -7.624044509005932
      ],
      [
        "your",
        -7.630951488558786
      ],
      [
        "additional",
        -7.633068646650703
      ],
      [
        "c",
        -7.640552242423911
      ],
      [
        "clari",
        -7.641061632950853
      ],
      [
        "processe",
        -7.653735023142202
      ],
      [
        "Problem",
        -7.680868143568481
      ],
      [
        "part",
        -7.681339414593365
      ],
      [
        "[",
        -7.690293008229921
      ],
      [
        "break",
        -7.693952149917603
      ],
      [
        "re",
        -7.721517050011547
      ],
      [
        "begin",
        -7.721590850991957
      ],
      [
        "thorough",
        -7.736886571246935
      ],
      [
        "solver",
        -7.742146757841157
      ],
      [
        "method",
        -7.753348022424093
      ],
      [
        "computation",
        -7.7533976407530325
      ],
      [
        "back",
        -7.7543498485358535
      ],
      [
        "math_solver",
        -7.76404591080475
      ],
      [
        "easoning",
        -7.776438402431121
      ],
      [
        "completeness",
        -7.785140577803167
      ],
      [
        "validate",
        -7.787232089318296
      ],
      [
        "identify",
        -7.795553226951937
      ],
      [
        "Depend",
        -7.798250495182459
      ],
      [
        "present",
        -7.799255513251511
      ],
      [
        "resolution",
        -7.809279343482673
      ],
      [
        "Start",
        -7.813217611303719
      ],
      [
        "give",
        -7.8243436548616865
      ],
      [
        "robust",
        -7.841044612408914
      ],
      [
        "analytical",
        -7.844233354103879
      ],
      [
        "Analysis",
        -7.855616982498525
      ],
      [
        "component",
        -7.871061205176208
      ],
      [
        "loop",
        -7.8739784918223155
      ],
      [
        "perform",
        -7.876887441175436
      ],
      [
        "Use",
        -7.884397642529076
      ],
      [
        "finalize",
        -7.890139121509774
      ],
      [
        "complexity",
        -7.891406843310997
      ],
      [
        "decision",
        -7.8966223296523985
      ],
      [
        "potential",
        -7.902065684852155
      ],
      [
        "clear",
        -7.90365160577626
      ],
      [
        "address",
        -7.909417143017154
      ],
      [
        "evaluation",
        -7.912528176667488
      ],
      [
        "play",
        -7.930564899972034
      ],
      [
        "identifie",
        -7.9430202156980725
      ],
      [
        "enhanced",
        -7.943576842971879
      ],
      [
        "challenge",
        -7.945486634922995
      ],
      [
        "determin",
        -7.979788218456373
      ],
      [
        "Refinement",
        -7.985034564250873
      ],
      [
        "derive",
        -7.998525996346308
      ],
      [
        "efficient",
        -8.026634502301267
      ],
      [
        "sub",
        -8.034799320441195
      ],
      [
        "ill",
        -8.044080760466805
      ],
      [
        "presente",
        -8.044507507697404
      ],
      [
        "conclude",
        -8.05339474768018
      ],
      [
        "drive",
        -8.056320660370918
      ],
      [
        "ation",
        -8.061696584732546
      ],
      [
        "critical",
        -8.066160137302411
      ],
      [
        "aspect",
        -8.071482435930866
      ],
      [
        "able",
        -8.071607964721322
      ],
      [
        "possibl",
        -8.082113741080875
      ],
      [
        "parent",
        -8.087528433503717
      ],
      [
        "Advanced",
        -8.08952420170495
      ],
      [
        "dynamical",
        -8.091530623959304
      ],
      [
        "reason",
        -8.097635534779842
      ],
      [
        "toward",
        -8.09838874470286
      ],
      [
        "accurate",
        -8.102202803636755
      ],
      [
        "LLM4",
        -8.10697605824118
      ],
      [
        "1",
        -8.107791794187726
      ],
      [
        "aim",
        -8.122983362020726
      ],
      [
        "S",
        -8.12904748280456
      ],
      [
        "resolve",
        -8.134297854592283
      ],
      [
        "where",
        -8.136591501435568
      ],
      [
        "2",
        -8.148819584574795
      ],
      [
        "logical",
        -8.169426661481783
      ],
      [
        "rigorous",
        -8.178069913385778
      ],
      [
        "compris",
        -8.185980540709245
      ],
      [
        "simple",
        -8.191031694983826
      ],
      [
        "integrat",
        -8.19116229701114
      ],
      [
        "crucial",
        -8.19196839680731
      ],
      [
        "answer",
        -8.206101169925265
      ],
      [
        "Final",
        -8.215394852846744
      ],
      [
        "Initial",
        -8.21554591497286
      ],
      [
        "Validator",
        -8.216285696135007
      ],
      [
        "refin",
        -8.21856386666223
      ],
      [
        "successfully",
        -8.225953316739828
      ],
      [
        "decide",
        -8.236616447491826
      ],
      [
        "dissect",
        -8.239009451921557
      ],
      [
        "conclusion",
        -8.251780014649155
      ],
      [
        "sequential",
        -8.268933211961073
      ],
      [
        "interim_check",
        -8.268934244630762
      ],
      [
        "calculation",
        -8.277246620159683
      ],
      [
        "enhance",
        -8.280763251858925
      ],
      [
        "needs",
        -8.284055643617016
      ],
      [
        "move",
        -8.286666792100696
      ],
      [
        "technique",
        -8.288580689743469
      ],
      [
        "progress",
        -8.290679224184686
      ],
      [
        "clarification",
        -8.308222738783318
      ],
      [
        "path",
        -8.314880308098708
      ],
      [
        "our",
        -8.320262281084617
      ],
      [
        "requir",
        -8.333561659331252
      ],
      [
        "optimized",
        -8.33550961247024
      ],
      [
        "conclud",
        -8.341192889081697
      ],
      [
        "contribute",
        -8.343881430401158
      ],
      [
        "can",
        -8.346450673612857
      ],
      [
        "iteration",
        -8.347485063850828
      ],
      [
        "input",
        -8.359460521776096
      ],
      [
        "meticulous",
        -8.361756149926967
      ],
      [
        "Enhanced",
        -8.364605637060297
      ],
      [
        "unique",
        -8.380918405382815
      ],
      [
        "all",
        -8.386612778521108
      ],
      [
        "confirmed",
        -8.388019873356193
      ],
      [
        "reli",
        -8.398545241302964
      ],
      [
        "issue",
        -8.416727291076505
      ],
      [
        "straightforward",
        -8.427957515740601
      ],
      [
        "arsing",
        -8.427965485402808
      ],
      [
        "multi",
        -8.42951822012116
      ],
      [
        "ability",
        -8.437473467207532
      ],
      [
        "after",
        -8.445860762311165
      ],
      [
        "basic",
        -8.461445564268361
      ],
      [
        "precise",
        -8.461469371228311
      ],
      [
        "optimize",
        -8.465109193005453
      ],
      [
        "initiati",
        -8.473063516639609
      ],
      [
        "first",
        -8.47465869583513
      ],
      [
        "sophisticat",
        -8.479984062514859
      ],
      [
        "exploration",
        -8.496424431386714
      ],
      [
        "mark",
        -8.501579224208061
      ],
      [
        "capabilit",
        -8.504483996282588
      ],
      [
        "outcome",
        -8.513342091886225
      ],
      [
        "quality",
        -8.51838429137126
      ],
      [
        "passe",
        -8.51880229000415
      ],
      [
        "forward",
        -8.52086083783867
      ],
      [
        "route",
        -8.52263714924053
      ],
      [
        "preliminary",
        -8.540584171200535
      ],
      [
        "provid",
        -8.541167040626357
      ],
      [
        "employ",
        -8.543366113427172
      ],
      [
        "hav",
        -8.545457480144329
      ],
      [
        "suggest",
        -8.548973324885601
      ],
      [
        "revision",
        -8.558283491057917
      ],
      [
        "ous",
        -8.560439317590527
      ],
      [
        "result",
        -8.560583173475017
      ],
      [
        "Base",
        -8.560670561245686
      ],
      [
        "ystem",
        -8.565078645919407
      ],
      [
        "vari",
        -8.576856645317115
      ],
      [
        "complexit",
        -8.577021269740015
      ],
      [
        "whe",
        -8.579738648346453
      ],
      [
        "reach",
        -8.581676948598606
      ],
      [
        "response",
        -8.584010286419709
      ],
      [
        "understanding",
        -8.585914990390977
      ],
      [
        "Context",
        -8.586980636546782
      ],
      [
        "distinct",
        -8.595932922098076
      ],
      [
        "high",
        -8.59640740567259
      ],
      [
        "handl",
        -8.597597393362406
      ],
      [
        "interpretation",
        -8.598861022063716
      ],
      [
        "assessment",
        -8.604649893567663
      ],
      [
        "sequen",
        -8.60499995276011
      ],
      [
        "mak",
        -8.607504645847325
      ],
      [
        "culminat",
        -8.612979942959319
      ],
      [
        "reformulate",
        -8.619520416940166
      ],
      [
        "integrated",
        -8.619703934229888
      ],
      [
        "Prompt",
        -8.623293127872262
      ],
      [
        "cycle",
        -8.626736798416513
      ],
      [
        "strategi",
        -8.635112342101522
      ],
      [
        "these",
        -8.636683041919678
      ],
      [
        "engage",
        -8.638751038658922
      ],
      [
        "jo",
        -8.639075498740208
      ],
      [
        "urne",
        -8.64355776313063
      ],
      [
        "introduce",
        -8.645176234330808
      ],
      [
        "approache",
        -8.649428365397938
      ],
      [
        "’",
        -8.664039186887068
      ],
      [
        "finaliz",
        -8.66522221393732
      ],
      [
        "Analyzer",
        -8.666080906723025
      ],
      [
        "successful",
        -8.671703996616298
      ],
      [
        "phase",
        -8.671888759166979
      ],
      [
        "cy",
        -8.673771009979838
      ],
      [
        "ated",
        -8.679937159279858
      ],
      [
        "ally",
        -8.68173808465922
      ],
      [
        "multip",
        -8.68480409546336
      ],
      [
        "includ",
        -8.68677282718118
      ],
      [
        "error",
        -8.692798873960042
      ],
      [
        "math",
        -8.700312362341686
      ],
      [
        "breakdown",
        -8.701474237566702
      ],
      [
        "algebra",
        -8.70324077980446
      ],
      [
        "point",
        -8.70656807090121
      ],
      [
        "enhanc",
        -8.707274427690137
      ],
      [
        "decomposition",
        -8.710162236252376
      ],
      [
        "Deep",
        -8.716510568537704
      ],
      [
        "operation",
        -8.716907086176032
      ],
      [
        "proceed",
        -8.733970451017715
      ],
      [
        "serve",
        -8.734376263990956
      ],
      [
        "nterpretation",
        -8.74456877863385
      ],
      [
        "integrate",
        -8.745374975086719
      ],
      [
        "different",
        -8.749398392391363
      ],
      [
        "optimization",
        -8.749590469347917
      ],
      [
        "calculus",
        -8.751163370822521
      ],
      [
        "efficien",
        -8.754206562087226
      ],
      [
        "geometry",
        -8.754978712740511
      ],
      [
        "optimal",
        -8.758423293586382
      ],
      [
        "explore",
        -8.760744954102014
      ],
      [
        "errors",
        -8.761432485810392
      ],
      [
        "require",
        -8.770899162101218
      ],
      [
        "dynamic",
        -8.7753296322352
      ],
      [
        "_solver",
        -8.777645542297126
      ],
      [
        "undergo",
        -8.787019101726678
      ],
      [
        "lead",
        -8.790642031250677
      ],
      [
        "hou",
        -8.805386034392772
      ],
      [
        "compute",
        -8.808850115161192
      ],
      [
        "flow",
        -8.80917376983917
      ],
      [
        "T",
        -8.810746653550485
      ],
      [
        "use",
        -8.823448926735399
      ],
      [
        "immediate",
        -8.82773498482116
      ],
      [
        "h",
        -8.829553742698632
      ],
      [
        "equation",
        -8.831522307415817
      ],
      [
        "valid",
        -8.843806072224579
      ],
      [
        "AdvancedMath",
        -8.850230495437938
      ],
      [
        "analyz",
        -8.850342922495031
      ],
      [
        "involve",
        -8.853765907176733
      ],
      [
        "W",
        -8.854052169450458
      ],
      [
        "ke",
        -8.858897232879384
      ],
      [
        "transferr",
        -8.859146369578415
      ],
      [
        "onfidence",
        -8.866274705968493
      ],
      [
        "complete",
        -8.86648846335383
      ],
      [
        "manage",
        -8.875225409618501
      ],
      [
        "elcome",
        -8.88613839473373
      ],
      [
        "self",
        -8.892503988375502
      ],
      [
        "ity",
        -8.893691682889594
      ],
      [
        "('",
        -8.894416682534203
      ],
      [
        "intricate",
        -8.898251256682022
      ],
      [
        "strategy",
        -8.902797352556378
      ],
      [
        "examin",
        -8.903999251910692
      ],
      [
        "conclusive",
        -8.910458587523769
      ],
      [
        "pathway",
        -8.91048572202509
      ],
      [
        "formation",
        -8.914426543309105
      ],
      [
        "}",
        -8.915390914612056
      ],
      [
        "detail",
        -8.91775258477421
      ],
      [
        "Solve",
        -8.918706267471908
      ],
      [
        "enhancement",
        -8.919010794951046
      ],
      [
        "standard",
        -8.922855407953344
      ],
      [
        "initiat",
        -8.924515955155012
      ],
      [
        "logic",
        -8.928629053417884
      ],
      [
        "subsequent",
        -8.935420228240119
      ],
      [
        "ight",
        -8.937232023330992
      ],
      [
        "over",
        -8.938445259724606
      ],
      [
        "ion",
        -8.941398309073953
      ],
      [
        "Composite",
        -8.94386450120917
      ],
      [
        "decompose",
        -8.94576399029858
      ],
      [
        "engin",
        -8.94813575508363
      ],
      [
        "Hybrid",
        -8.951603946348925
      ],
      [
        "introduc",
        -8.956579889625534
      ],
      [
        "solution_found",
        -8.956800716411795
      ],
      [
        "focus",
        -8.96186020765861
      ],
      [
        "represent",
        -8.962585297329195
      ],
      [
        "')",
        -8.966214057984054
      ],
      [
        "layer",
        -8.966316544890322
      ],
      [
        "current",
        -8.974039153586139
      ],
      [
        "strategic",
        -8.97487232930592
      ],
      [
        "assess",
        -8.975005126472482
      ],
      [
        "llm_solution_",
        -8.979110272772548
      ],
      [
        "_not_found",
        -8.991141708818791
      ],
      [
        "arithmetic",
        -8.991699628001518
      ],
      [
        "meet",
        -8.991783118247492
      ],
      [
        "dual",
        -8.99232640684152
      ],
      [
        "proposed",
        -9.00110887449987
      ],
      [
        "Primary",
        -9.005152723177037
      ],
      [
        "intermediate",
        -9.008817886470444
      ],
      [
        "definitive",
        -9.009687643541064
      ],
      [
        "synthesize",
        -9.010005262363808
      ],
      [
        "LLM_solver",
        -9.022738925331316
      ],
      [
        "takes",
        -9.024894751840028
      ],
      [
        "SolverLLM",
        -9.025279147105698
      ],
      [
        "appropriate",
        -9.027984725515761
      ],
      [
        "ple",
        -9.028434533947888
      ],
      [
        "uncertain",
        -9.031022936356798
      ],
      [
        "describe",
        -9.031673438575604
      ],
      [
        "tackl",
        -9.037061199128324
      ],
      [
        "formulate",
        -9.038482059622472
      ],
      [
        "MathSolverLLM",
        -9.038920019019907
      ],
      [
        "leverage",
        -9.041395274666868
      ],
      [
        "previous",
        -9.041938478319004
      ],
      [
        "Review",
        -9.04919747025205
      ],
      [
        "parse",
        -9.050710890487768
      ],
      [
        "Refiner",
        -9.052646445719141
      ],
      [
        "deliver",
        -9.060851482594764
      ],
      [
        "algebraic",
        -9.074646220548548
      ],
      [
        "concept",
        -9.079764970049002
      ],
      [
        "transition",
        -9.089913247438433
      ],
      [
        "adjustment",
        -9.095294851258998
      ],
      [
        "finding",
        -9.096756600834496
      ],
      [
        "Verifie",
        -9.103685280359155
      ],
      [
        "Comprehensive",
        -9.114786004304255
      ],
      [
        "seri",
        -9.114957524052581
      ],
      [
        "interconnect",
        -9.125038282408813
      ],
      [
        "apply",
        -9.130691412974304
      ],
      [
        "collaborate",
        -9.130886217111506
      ],
      [
        "ive",
        -9.132093982378354
      ],
      [
        "systematic",
        -9.135144492083125
      ],
      [
        "conduct",
        -9.140297536632199
      ],
      [
        "red",
        -9.144924291175204
      ],
      [
        "highe",
        -9.155086587824226
      ],
      [
        "focuse",
        -9.161766554358755
      ],
      [
        "L",
        -9.177095062735901
      ],
      [
        "append",
        -9.17735551315824
      ],
      [
        "llm_",
        -9.187591160280355
      ],
      [
        "verifier",
        -9.189823139272166
      ],
      [
        "tailor",
        -9.199616890436795
      ],
      [
        "Optimizer",
        -9.199754834513502
      ],
      [
        "scrutinize",
        -9.200195718876602
      ],
      [
        "Begin",
        -9.204319299314356
      ],
      [
        "simplify",
        -9.204319327364711
      ],
      [
        "Handler",
        -9.206782062807395
      ],
      [
        "primary",
        -9.221688353645838
      ],
      [
        "level",
        -9.22660581266295
      ],
      [
        "D",
        -9.23158838012024
      ],
      [
        "consist",
        -9.232247085538162
      ],
      [
        "indicat",
        -9.242308703742044
      ],
      [
        "articulate",
        -9.247909872140488
      ],
      [
        "confident",
        -9.249397178536753
      ],
      [
        "presentation",
        -9.250746226753714
      ],
      [
        "categorize",
        -9.258559957982936
      ],
      [
        "function",
        -9.265831706683933
      ],
      [
        "investigation",
        -9.266856974409485
      ],
      [
        "leverag",
        -9.26751997209377
      ],
      [
        "receiv",
        -9.267602384524276
      ],
      [
        "fre",
        -9.27005117255849
      ],
      [
        "depend",
        -9.272735189426939
      ],
      [
        "reflection",
        -9.272742081678052
      ],
      [
        "ready",
        -9.273367680015278
      ],
      [
        "Interpret",
        -9.274731515346572
      ],
      [
        "methodolog",
        -9.276692914069878
      ],
      [
        "til",
        -9.28716759868999
      ],
      [
        "area",
        -9.28755063706274
      ],
      [
        "Clarification",
        -9.290579349480632
      ],
      [
        "include",
        -9.296865640870955
      ],
      [
        "llm_refinement",
        -9.297175988231805
      ],
      [
        "when",
        -9.30298056538351
      ],
      [
        "Optimization",
        -9.308762753150639
      ],
      [
        "Analyze",
        -9.316612118284791
      ],
      [
        "addresse",
        -9.321637227819362
      ],
      [
        "Ou",
        -9.327648702799108
      ],
      [
        "validat",
        -9.34057859503782
      ],
      [
        "decid",
        -9.341011980346416
      ],
      [
        "methodologi",
        -9.341915649011767
      ],
      [
        "cross",
        -9.34450371536295
      ],
      [
        "indicate",
        -9.347552320114492
      ],
      [
        "needs_",
        -9.347847681487718
      ],
      [
        "Equation",
        -9.349373386393633
      ],
      [
        "whil",
        -9.359018108917823
      ],
      [
        "Validate",
        -9.365380320139087
      ],
      [
        "examine",
        -9.369605024856112
      ],
      [
        "offer",
        -9.371914036391205
      ],
      [
        "symbolic",
        -9.372302068231603
      ],
      [
        "generate",
        -9.376537633997517
      ],
      [
        "Decomposer",
        -9.379626546309854
      ],
      [
        "commence",
        -9.380577911932185
      ],
      [
        "LLM_Solver",
        -9.38126862020031
      ],
      [
        "validator",
        -9.383925102786971
      ],
      [
        "Follow",
        -9.385171747722936
      ],
      [
        "Detailed",
        -9.386040646180064
      ],
      [
        "geometric",
        -9.386436678988636
      ],
      [
        "crit",
        -9.391597097832449
      ],
      [
        "eria",
        -9.391663905733623
      ],
      [
        "delve",
        -9.393012640836204
      ],
      [
        "analyse",
        -9.398519625311923
      ],
      [
        "pos",
        -9.399317311231517
      ],
      [
        "solution_validat",
        -9.402733905561146
      ],
      [
        "improvement",
        -9.405011592261147
      ],
      [
        "wel",
        -9.406824813756863
      ],
      [
        "request",
        -9.411747412278228
      ],
      [
        "insert",
        -9.411747624277787
      ],
      [
        "lement",
        -9.411756284940992
      ],
      [
        "scenario",
        -9.418548792064406
      ],
      [
        "communicate",
        -9.423229029399131
      ],
      [
        "ProblemSolver",
        -9.425876934986027
      ],
      [
        "consistency",
        -9.43395876847394
      ],
      [
        "Initiate",
        -9.434509378010013
      ],
      [
        "combin",
        -9.437878861330592
      ],
      [
        "iv",
        -9.438606338242577
      ],
      [
        "like",
        -9.439250596316061
      ],
      [
        "incorporat",
        -9.439616637591698
      ],
      [
        "detect",
        -9.442468834899984
      ],
      [
        "deriv",
        -9.450169496819523
      ],
      [
        "construct",
        -9.453166969646178
      ],
      [
        "simplification",
        -9.453174983895337
      ],
      [
        "reas",
        -9.470304896477455
      ],
      [
        "responsib",
        -9.474037346413839
      ],
      [
        "mov",
        -9.481096217730848
      ],
      [
        "guide",
        -9.491067729559031
      ],
      [
        "expression",
        -9.49660225221492
      ],
      [
        "Node",
        -9.496608087848145
      ],
      [
        ";",
        -9.50400965960992
      ],
      [
        "‘",
        -9.511472346177083
      ],
      [
        "Interpreter",
        -9.511535428441869
      ],
      [
        "verifie",
        -9.514068607488623
      ],
      [
        "contribut",
        -9.519102809831443
      ],
      [
        "anne",
        -9.522911683297188
      ],
      [
        "LLM_math_solver",
        -9.52604141516321
      ],
      [
        "llm_problem_",
        -9.530904079890494
      ],
      [
        "statistics",
        -9.542078125357644
      ],
      [
        "special",
        -9.549469422498243
      ],
      [
        "F",
        -9.549948951525426
      ],
      [
        "Reviewe",
        -9.56104010071105
      ],
      [
        "v",
        -9.579364492442135
      ],
      [
        "ultimate",
        -9.58126776632876
      ],
      [
        "option",
        -9.589220082423392
      ],
      [
        "setup",
        -9.59229884645513
      ],
      [
        "utiliz",
        -9.597241306857336
      ],
      [
        "efined",
        -9.611530338901462
      ],
      [
        "P",
        -9.612802085780423
      ],
      [
        "rout",
        -9.613807724601767
      ],
      [
        "Output",
        -9.613923606961805
      ],
      [
        "receive",
        -9.621178986511351
      ],
      [
        "propose",
        -9.625347830349643
      ],
      [
        "undertake",
        -9.631678725506916
      ],
      [
        "polishe",
        -9.63186446127806
      ],
      [
        "completion",
        -9.647685777667876
      ],
      [
        "data",
        -9.648631900697278
      ],
      [
        "sent",
        -9.659248212713415
      ],
      [
        "out",
        -9.661395775473816
      ],
      [
        "requirement",
        -9.665138398092406
      ],
      [
        "revise",
        -9.66696283538359
      ],
      [
        "O",
        -9.668712787706502
      ],
      [
        "via",
        -9.669023968483748
      ],
      [
        "_solution_node",
        -9.669650215496517
      ],
      [
        "off",
        -9.670069293697594
      ],
      [
        "focused",
        -9.671014840112099
      ],
      [
        "approv",
        -9.673654655089354
      ],
      [
        "scrutin",
        -9.67367588305968
      ],
      [
        "broad",
        -9.683151322538894
      ],
      [
        "optimiz",
        -9.683969382285193
      ],
      [
        "etup",
        -9.68829526210024
      ],
      [
        "clarifications",
        -9.69108236759476
      ],
      [
        "Complex",
        -9.691439745877723
      ],
      [
        "fully",
        -9.693470272918903
      ],
      [
        "state",
        -9.69494423099183
      ],
      [
        "_interpreter",
        -9.697861745231661
      ],
      [
        "_combined",
        -9.699912825145645
      ],
      [
        "_clarification",
        -9.702652111206168
      ],
      [
        "case",
        -9.710305483815313
      ],
      [
        "synthesiz",
        -9.711883016876158
      ],
      [
        "integration",
        -9.712438043683473
      ],
      [
        "ance",
        -9.716716076943538
      ],
      [
        "x",
        -9.71847105950407
      ],
      [
        "Work",
        -9.71882259717808
      ],
      [
        "After",
        -9.718824211503364
      ],
      [
        "hybrid",
        -9.725860846186578
      ],
      [
        "explor",
        -9.727253591520746
      ],
      [
        "/",
        -9.728081708830356
      ],
      [
        "Model",
        -9.728081709109386
      ],
      [
        "format",
        -9.728331130883198
      ],
      [
        "EquationS",
        -9.728508414263345
      ],
      [
        "incorrect",
        -9.734299643867176
      ],
      [
        "arge",
        -9.737022447742511
      ],
      [
        "particular",
        -9.737427821562743
      ],
      [
        "interim",
        -9.74514223942159
      ],
      [
        "craft",
        -9.746861598732885
      ],
      [
        "methodical",
        -9.746903918370196
      ],
      [
        "involv",
        -9.748792052278038
      ],
      [
        "ust",
        -9.754155078413424
      ],
      [
        "evaluative",
        -9.756427051467398
      ],
      [
        "combined",
        -9.762001883069347
      ],
      [
        "reevaluation",
        -9.765196374886033
      ],
      [
        "outline",
        -9.765292603286998
      ],
      [
        "ment",
        -9.76563359980265
      ],
      [
        "age",
        -9.767257633863922
      ],
      [
        "respective",
        -9.775709398434081
      ],
      [
        "Up",
        -9.77650466801948
      ],
      [
        "llm_refinement_",
        -9.789198057169862
      ],
      [
        "En",
        -9.79158306437117
      ],
      [
        "nuance",
        -9.805439270732732
      ],
      [
        "exhaustive",
        -9.805480524033651
      ],
      [
        "equip",
        -9.806269803092043
      ],
      [
        "HybridMathSolver",
        -9.809056449896126
      ],
      [
        "rise",
        -9.810301168483335
      ],
      [
        "LLM_integrat",
        -9.815064523088203
      ],
      [
        "Algebra",
        -9.815512274996516
      ],
      [
        "question",
        -9.815515883348226
      ],
      [
        "Combined",
        -9.816267278314886
      ],
      [
        "innovative",
        -9.816391513694725
      ],
      [
        "Handle",
        -9.821150952769973
      ],
      [
        "very",
        -9.822275895046886
      ],
      [
        "\"",
        -9.8257194008916
      ],
      [
        "LLM_parse",
        -9.826439832066537
      ],
      [
        "Po",
        -9.827029182478675
      ],
      [
        "kick",
        -9.841026117307523
      ],
      [
        "parallel",
        -9.84664895551926
      ],
      [
        "seamless",
        -9.846688775873563
      ],
      [
        "finalizer",
        -9.85047822842482
      ],
      [
        "lector",
        -9.851107229068312
      ],
      [
        "category",
        -9.856971663885925
      ],
      [
        "utilize",
        -9.857259548724576
      ],
      [
        "LLM_ref",
        -9.862635204315481
      ],
      [
        "Correct",
        -9.867609959600324
      ],
      [
        "redirect",
        -9.86916337229859
      ],
      [
        "...",
        -9.872894347231416
      ],
      [
        "Solution_",
        -9.876560750392262
      ],
      [
        "&",
        -9.878362647742641
      ],
      [
        "mechanism",
        -9.878364879107764
      ],
      [
        "framework",
        -9.878403677425755
      ],
      [
        "Ensure",
        -9.87851356185023
      ],
      [
        "For",
        -9.881217486433382
      ],
      [
        "integr",
        -9.881675753085723
      ],
      [
        "resolv",
        -9.88783266581595
      ],
      [
        "Detect",
        -9.889127043401714
      ],
      [
        "implicit",
        -9.8892322678915
      ],
      [
        "operate",
        -9.889498037989817
      ],
      [
        "LLM_decompose",
        -9.893153214952804
      ],
      [
        "ve",
        -9.897115141989353
      ],
      [
        "Integrate",
        -9.903539828771361
      ],
      [
        "Present",
        -9.90697156786162
      ],
      [
        "Refine",
        -9.909621872712272
      ],
      [
        "Geometry",
        -9.911332335060152
      ],
      [
        "continuous",
        -9.911350536439906
      ],
      [
        "expert",
        -9.91149921738288
      ],
      [
        "but",
        -9.91431820883902
      ],
      [
        "simplifie",
        -9.914391829292938
      ],
      [
        "combine",
        -9.922518316526844
      ],
      [
        "All",
        -9.934434412964947
      ],
      [
        "iscrepanc",
        -9.937196331108474
      ],
      [
        "categoriz",
        -9.93914295309052
      ],
      [
        "subproblem",
        -9.941719064010186
      ],
      [
        "coherent",
        -9.945426181430436
      ],
      [
        "clarify",
        -9.945571648389915
      ],
      [
        "confirmation",
        -9.94909817739451
      ],
      [
        "Dual",
        -9.95590784609174
      ],
      [
        "trigger",
        -9.957054086352432
      ],
      [
        "visualiz",
        -9.958669438118658
      ],
      [
        "problem_parser",
        -9.968824889439198
      ],
      [
        "replace",
        -9.969138707019459
      ],
      [
        "bject",
        -9.969331793035854
      ],
      [
        "uncertaint",
        -9.972899143348336
      ],
      [
        "Subsequent",
        -9.980724400058358
      ],
      [
        "divers",
        -9.98091821794188
      ],
      [
        "Utilize",
        -9.983124660717541
      ],
      [
        "C",
        -9.984647515005715
      ],
      [
        "classification",
        -9.992771746890117
      ],
      [
        "Secondary",
        -9.992826218164453
      ],
      [
        "reassess",
        -9.995161608213607
      ],
      [
        "achieve",
        -9.997462390391028
      ],
      [
        "culminate",
        -10.00153511690549
      ],
      [
        "math_solver_",
        -10.00470705861993
      ],
      [
        "round",
        -10.006680497079964
      ],
      [
        "assur",
        -10.01498098688514
      ],
      [
        "stat",
        -10.015092738951381
      ],
      [
        "optimizer",
        -10.015815804701802
      ],
      [
        "facet",
        -10.021895060138457
      ],
      [
        "nce",
        -10.023742744346395
      ],
      [
        "llm_advanced_",
        -10.027351546944578
      ],
      [
        "update",
        -10.03022711088466
      ],
      [
        "Enhance",
        -10.034663906633872
      ],
      [
        "Process",
        -10.038652544679932
      ],
      [
        "synthesi",
        -10.03865927154613
      ],
      [
        "alidity",
        -10.039605437645733
      ],
      [
        "sibility",
        -10.041285246807623
      ],
      [
        "coherenc",
        -10.042470794880423
      ],
      [
        "segment",
        -10.042556728552556
      ],
      [
        "clarifie",
        -10.055677964731409
      ],
      [
        "advance",
        -10.05570888650418
      ],
      [
        "user",
        -10.05630081866999
      ],
      [
        "identifi",
        -10.05733408829175
      ],
      [
        "place",
        -10.067925433257262
      ],
      [
        "holistic",
        -10.068335940945396
      ],
      [
        "cou",
        -10.072949988937076
      ],
      [
        "abstract",
        -10.081561145476574
      ],
      [
        "iterat",
        -10.09006705088018
      ],
      [
        "B",
        -10.094356223896632
      ],
      [
        "synta",
        -10.09476237007255
      ],
      [
        "Perform",
        -10.094769533695205
      ],
      [
        "prepar",
        -10.098266790689962
      ],
      [
        "flag",
        -10.10277836549808
      ],
      [
        "extensive",
        -10.108283184860923
      ],
      [
        "Computation",
        -10.108314676593539
      ],
      [
        "problemClarifier",
        -10.114061680913315
      ],
      [
        "ature",
        -10.119863060602375
      ],
      [
        "parse_problem",
        -10.123558041726064
      ],
      [
        "ngu",
        -10.123582206262059
      ],
      [
        "hybrid_",
        -10.124699655926095
      ],
      [
        "mall",
        -10.129910540243309
      ],
      [
        "denote",
        -10.13588798764204
      ],
      [
        "relat",
        -10.139494108276496
      ],
      [
        "formulation",
        -10.142716642682181
      ],
      [
        "Integrated",
        -10.160563649752095
      ],
      [
        "dive",
        -10.161042648542413
      ],
      [
