{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "e",
        -2.307568443624982
      ],
      [
        "s",
        -2.5734703840921167
      ],
      [
        "t",
        -2.6783659202379475
      ],
      [
        "o",
        -2.716189915272036
      ],
      [
        "a",
        -2.74848534858058
      ],
      [
        "h",
        -2.798755169571571
      ],
      [
        "n",
        -3.0507463773241827
      ],
      [
        "i",
        -3.1865269660323907
      ],
      [
        "r",
        -3.4200601517830744
      ],
      [
        "l",
        -3.5890256644457086
      ],
      [
        "f",
        -3.6320493487614876
      ],
      [
        "d",
        -3.6839041827080106
      ],
      [
        ".",
        -3.8300080191275345
      ],
      [
        "m",
        -3.9131539743044446
      ],
      [
        "w",
        -3.9932742003519106
      ],
      [
        "y",
        -4.0926476342318985
      ],
      [
        "c",
        -4.125836796491045
      ],
      [
        "b",
        -4.166803138815899
      ],
      [
        ",",
        -4.432450870102496
      ],
      [
        "u",
        -4.4340887987034545
      ],
      [
        "g",
        -4.552191766820771
      ],
      [
        "p",
        -4.658484754567876
      ],
      [
        "?",
        -5.062500695781393
      ],
      [
        "0",
        -5.128178130381096
      ],
      [
        "and",
        -5.266539554055587
      ],
      [
        "$",
        -5.4048486992210325
      ],
      [
        "ing",
        -5.436267723674449
      ],
      [
        "2",
        -5.494304218739703
      ],
      [
        "1",
        -5.512020999401399
      ],
      [
        "each",
        -5.549660468926453
      ],
      [
        "How",
        -5.589623002523075
      ],
      [
        "for",
        -5.648524429616847
      ],
      [
        "I",
        -5.675784805530462
      ],
      [
        "5",
        -5.713828297422786
      ],
      [
        "v",
        -5.818024764836615
      ],
      [
        "k",
        -5.827495424154257
      ],
      [
        "4",
        -5.8278325018794295
      ],
      [
        "the",
        -5.854196273207027
      ],
      [
        "cost",
        -5.870757562353633
      ],
      [
        "3",
        -5.961117713611406
      ],
      [
        "S",
        -5.966156548924461
      ],
      [
        "6",
        -6.015078817243072
      ],
      [
        "A",
        -6.114257141991846
      ],
      [
        "The",
        -6.185805842915872
      ],
      [
        "8",
        -6.217869730083175
      ],
      [
        "-",
        -6.235979527583371
      ],
      [
        "minute",
        -6.2662291183023715
      ],
      [
        "day",
        -6.26899035084061
      ],
      [
        "T",
        -6.291330096417106
      ],
      [
        "hour",
        -6.296607714946145
      ],
      [
        "year",
        -6.322498157695781
      ],
      [
        "string",
        -6.323023891160915
      ],
      [
        "gift",
        -6.330247875103316
      ],
      [
        "'",
        -6.346433347086339
      ],
      [
        "J",
        -6.387522616184377
      ],
      [
        "buy",
        -6.388469321812346
      ],
      [
        "every",
        -6.433640776219752
      ],
      [
        "howl",
        -6.4676323741220845
      ],
      [
        "H",
        -6.498678947064409
      ],
      [
        "x",
        -6.513816257595661
      ],
      [
        "ill",
        -6.5754967789528145
      ],
      [
        "C",
        -6.58278259908125
      ],
      [
        "R",
        -6.628817559606482
      ],
      [
        "crea",
        -6.684565285349981
      ],
      [
        "cup",
        -6.701269130866002
      ],
      [
        "want",
        -6.711117755481421
      ],
      [
        "save",
        -6.724207852452382
      ],
      [
        "D",
        -6.737930244166227
      ],
      [
        "player",
        -6.780322128841471
      ],
      [
        "wrap",
        -6.796506292189784
      ],
      [
        "time",
        -6.800369047269829
      ],
      [
        "inch",
        -6.823197922490413
      ],
      [
        "other",
        -6.826526545625315
      ],
      [
        "does",
        -6.830079826863212
      ],
      [
        "week",
        -6.8953564628031145
      ],
      [
        "And",
        -6.904688606745484
      ],
      [
        "ynth",
        -6.909795781312026
      ],
      [
        "chicken",
        -6.929823625062712
      ],
      [
        "make",
        -6.9604009240937135
      ],
      [
        "W",
        -6.96184040028667
      ],
      [
        "F",
        -6.992683907912308
      ],
      [
        "color",
        -7.024747842423631
      ],
      [
        "ounce",
        -7.072496805010028
      ],
      [
        "steak",
        -7.072596742010141
      ],
      [
        "earn",
        -7.094935792933098
      ],
      [
        "carton",
        -7.096261760868325
      ],
      [
        "how",
        -7.096484815025931
      ],
      [
        "20",
        -7.104035984389364
      ],
      [
        "pound",
        -7.108013143923056
      ],
      [
        "second",
        -7.121060832042465
      ],
      [
        "read",
        -7.12346196574393
      ],
      [
        "ave",
        -7.13640255992479
      ],
      [
        "watche",
        -7.1455003307806635
      ],
      [
        "third",
        -7.157056261593837
      ],
      [
        "00",
        -7.168008991794686
      ],
      [
        "stop",
        -7.182246411855859
      ],
      [
        "spend",
        -7.183167949703503
      ],
      [
        "pencil",
        -7.203456814416279
      ],
      [
        "7",
        -7.203660885341636
      ],
      [
        "sell",
        -7.204379681300214
      ],
      [
        "30",
        -7.2062008476006145
      ],
      [
        "friend",
        -7.209380446349364
      ],
      [
        "class",
        -7.216625951428934
      ],
      [
        "hair",
        -7.222284241391884
      ],
      [
        "feed",
        -7.23989104031957
      ],
      [
        "bees",
        -7.246890474193149
      ],
      [
        "stamp",
        -7.255863926595218
      ],
      [
        "shark",
        -7.259305979418205
      ],
      [
        "all",
        -7.269079321509025
      ],
      [
        "take",
        -7.277204944243628
      ],
      [
        "episode",
        -7.303096443310105
      ],
      [
        "need",
        -7.303527821453104
      ],
      [
        "O",
        -7.305094602633215
      ],
      [
        "meal",
        -7.332399304895793
      ],
      [
        "pack",
        -7.337471206923073
      ],
      [
        "bus",
        -7.351828471987043
      ],
      [
        "allo",
        -7.365136843945107
      ],
      [
        "ake",
        -7.377467092022297
      ],
      [
        "work",
        -7.378967700259929
      ],
      [
        "ther",
        -7.401846592244292
      ],
      [
        "15",
        -7.409462180809623
      ],
      [
        "B",
        -7.419459588755512
      ],
      [
        "candle",
        -7.423153994830809
      ],
      [
        "Ev",
        -7.451849439149431
      ],
      [
        "40",
        -7.462747822311028
      ],
      [
        "movie",
        -7.484233171759419
      ],
      [
        "ticke",
        -7.489258433955547
      ],
      [
        "tters",
        -7.492553416678508
      ],
      [
        "give",
        -7.49573512739666
      ],
      [
        "ive",
        -7.501124738023156
      ],
      [
        "serving",
        -7.505715866795935
      ],
      [
        "%",
        -7.513503548164669
      ],
      [
        "neous",
        -7.515187119361238
      ],
      [
        "P",
        -7.520291199822518
      ],
      [
        "termi",
        -7.531174156029332
      ],
      [
        "ple",
        -7.536019564508903
      ],
      [
        "start",
        -7.549898245215388
      ],
      [
        "Ant",
        -7.57754648667521
      ],
      [
        "late",
        -7.577958378212154
      ],
      [
        "after",
        -7.581861078014949
      ],
      [
        "que",
        -7.587313775985493
      ],
      [
        "ize",
        -7.6031055594836054
      ],
      [
        "V",
        -7.617023130160982
      ],
      [
        "ung",
        -7.649359419926952
      ],
      [
        "E",
        -7.649710948173672
      ],
      [
        "teacher",
        -7.664596428377063
      ],
      [
        "fore",
        -7.680930050553261
      ],
      [
        "decide",
        -7.6837916650007525
      ],
      [
        "ming",
        -7.6959157431337655
      ],
      [
        "order",
        -7.721127712521467
      ],
      [
        "ook",
        -7.737197189155427
      ],
      [
        "ores",
        -7.760450404677831
      ],
      [
        "etter",
        -7.764081662947612
      ],
      [
        "vegeta",
        -7.766196084403326
      ],
      [
        "return",
        -7.767449212674867
      ],
      [
        "cont",
        -7.794873187061229
      ],
      [
        "Mon",
        -7.819550302031423
      ],
      [
        "j",
        -7.830446125668942
      ],
      [
        "com",
        -7.839244526076416
      ],
      [
        "Car",
        -7.85431958281891
      ],
      [
        "basket",
        -7.854865881507674
      ],
      [
        "vera",
        -7.855461638241525
      ],
      [
        "igh",
        -7.85708398684804
      ],
      [
        "Christ",
        -7.862389744123191
      ],
      [
        "home",
        -7.8917536249316305
      ],
      [
        "turn",
        -7.898290606209326
      ],
      [
        "10",
        -7.903861778678697
      ],
      [
        "her",
        -7.904829924695307
      ],
      [
        "stuff",
        -7.915075088273098
      ],
      [
        "like",
        -7.919681423670675
      ],
      [
        "fourt",
        -7.944883254306621
      ],
      [
        "glass",
        -7.977100924862412
      ],
      [
        "complete",
        -7.993255826153796
      ],
      [
        "leav",
        -7.99599848903118
      ],
      [
        "inal",
        -7.998834656936053
      ],
      [
        "frie",
        -8.015391788499969
      ],
      [
        "weekend",
        -8.025709566123501
      ],
      [
        "allow",
        -8.028045394004412
      ],
      [
        "lock",
        -8.037332325544263
      ],
      [
        "last",
        -8.063142174327943
      ],
      [
        "pol",
        -8.068322898908658
      ],
      [
        "wic",
        -8.081332945578925
      ],
      [
        "/",
        -8.088621992058403
      ],
      [
        "Wend",
        -8.102142403429436
      ],
      [
        "in",
        -8.109503632475583
      ],
      [
        "M",
        -8.114020969287157
      ],
      [
        "’",
        -8.177042662594694
      ],
      [
        "N",
        -8.177042662594694
      ],
      [
        "per",
        -8.18094938706722
      ],
      [
        "very",
        -8.208426762646539
      ],
      [
        "finishe",
        -8.20843995704805
      ],
      [
        "live",
        -8.221269990973207
      ],
      [
        "went",
        -8.221355955207734
      ],
      [
        "collecti",
        -8.256326589955604
      ],
      [
        "help",
        -8.2634179046285
      ],
      [
        "(",
        -8.264628268382129
      ],
      [
        ")",
        -8.264628268382129
      ],
      [
        "pens",
        -8.275893034726968
      ],
      [
        "50",
        -8.305252737267868
      ],
      [
        "ack",
        -8.319260054965547
      ],
      [
        "box",
        -8.32518747881319
      ],
      [
        "speci",
        -8.34149193875577
      ],
      [
        "mor",
        -8.345635217876822
      ],
      [
        "60",
        -8.369626596315285
      ],
      [
        "fter",
        -8.388905922905236
      ],
      [
        "cons",
        -8.396212705760451
      ],
      [
        "collect",
        -8.39802791010582
      ],
      [
        "ffic",
        -8.403483614364387
      ],
      [
        "comp",
        -8.415584681712108
      ],
      [
        "ater",
        -8.441120154868585
      ],
      [
        "orange",
        -8.483587435749207
      ],
      [
        "run",
        -8.485197360512608
      ],
      [
        "him",
        -8.50017458457262
      ],
      [
        "salar",
        -8.500840928023162
      ],
      [
        "Jen",
        -8.515969127768397
      ],
      [
        "hav",
        -8.525947174378045
      ],
      [
        "aper",
        -8.53025998201778
      ],
      [
        "K",
        -8.533825853765588
      ],
      [
        "mon",
        -8.53804731441605
      ],
      [
        "th",
        -8.542804660933854
      ],
      [
        ":",
        -8.550565690792217
      ],
      [
        "enni",
        -8.571699514105681
      ],
      [
        "cand",
        -8.586100489502202
      ],
      [
        "supp",
        -8.595067708052564
      ],
      [
        "lemon",
        -8.619666591176046
      ],
      [
        "arlie",
        -8.633364961781158
      ],
      [
        "eras",
        -8.634761570844052
      ],
      [
        "rank",
        -8.6622666072901
      ],
      [
        "animal",
        -8.666349166427764
      ],
      [
        "drive",
        -8.708539490278046
      ],
      [
        "watch",
        -8.710036121820949
      ],
      [
        "yard",
        -8.715652476344186
      ],
      [
        "ver",
        -8.72026575965645
      ],
      [
        "line",
        -8.73209461162622
      ],
      [
        "soda",
        -8.760758985420257
      ],
      [
        "pigeon",
        -8.79102253035121
      ],
      [
        "brea",
        -8.804667042307122
      ],
      [
        "but",
        -8.808089523016136
      ],
      [
        "vote",
        -8.838430527633335
      ],
      [
        "ving",
        -8.867079120732729
      ],
      [
        "On",
        -8.881216194014048
      ],
      [
        "attend",
        -8.894661991270183
      ],
      [
        "monitor",
        -8.89537045375052
      ],
      [
        "some",
        -8.89686346103198
      ],
      [
        "dock",
        -8.915768296524472
      ],
      [
        "hou",
        -8.942240686556906
      ],
      [
        "tic",
        -8.970429012702489
      ],
      [
        "artic",
        -8.971580670045963
      ],
      [
        "pick",
        -8.975462833444954
      ],
      [
        "plan",
        -8.975813560813581
      ],
      [
        "eache",
        -8.991127458464588
      ],
      [
        "ng",
        -9.00861699369689
      ],
      [
        "din",
        -9.012373866164975
      ],
      [
        "ll",
        -9.024049761078293
      ],
      [
        "ence",
        -9.0413781482795
      ],
      [
        "he",
        -9.045381078621404
      ],
      [
        "stay",
        -9.046808588229823
      ],
      [
        "plant",
        -9.058537659262623
      ],
      [
        "9",
        -9.066296250154045
      ],
      [
        "peel",
        -9.073452658875915
      ],
      [
        "can",
        -9.076739322327018
      ],
      [
        "L",
        -9.081157202864114
      ],
      [
        "ick",
        -9.103529095187252
      ],
      [
        "G",
        -9.165732927057242
      ],
      [
        "nd",
        -9.180485834836713
      ],
      [
        "ince",
        -9.186655938891423
      ],
      [
        "mate",
        -9.200616278330536
      ],
      [
        "adult",
        -9.211762174664846
      ],
      [
        "publishe",
        -9.218877841681486
      ],
      [
        "motorcycle",
        -9.24665977298058
      ],
      [
        "12",
        -9.254759848134743
      ],
      [
        "Fr",
        -9.255996713362869
      ],
      [
        "percent",
        -9.25683069484852
      ],
      [
        "inst",
        -9.266466869242514
      ],
      [
        "sleepwalk",
        -9.289800650012435
      ],
      [
        "an",
        -9.292705669689322
      ],
      [
        "sleep",
        -9.29606456263649
      ],
      [
        "Mar",
        -9.296242794392818
      ],
      [
        "ter",
        -9.303091960054019
      ],
      [
        "ve",
        -9.347841966490613
      ],
      [
        "ell",
        -9.352843321201199
      ],
      [
        "girl",
        -9.362631028248975
      ],
      [
        "ende",
        -9.364714468890213
      ],
      [
        "part",
        -9.373062281856935
      ],
      [
        "Sun",
        -9.373538822823855
      ],
      [
        "oll",
        -9.391742830250575
      ],
      [
        "four",
        -9.399169895594426
      ],
      [
        "group",
        -9.428475563260086
      ],
      [
        "increas",
        -9.435749812039951
      ],
      [
        "ound",
        -9.442743744487435
      ],
      [
        "tha",
        -9.481772058955464
      ],
      [
        "neighbor",
        -9.494852082983726
      ],
      [
        "con",
        -9.495348207474708
      ],
      [
        "pair",
        -9.51154074317392
      ],
      [
        "wer",
        -9.515808651113321
      ],
      [
        "ach",
        -9.543290546839575
      ],
      [
        "carr",
        -9.544233914939802
      ],
      [
        "qu",
        -9.571683504142435
      ],
      [
        "driv",
        -9.58146761762077
      ],
      [
        "poli",
        -9.583337103643716
      ],
      [
        "port",
        -9.58376551283347
      ],
      [
        "age",
        -9.584736296745827
      ],
      [
        "coll",
        -9.606758988362394
      ],
      [
        "come",
        -9.620548894675649
      ],
      [
        "website",
        -9.62495351045667
      ],
      [
        "bu",
        -9.625653174621217
      ],
      [
        "400",
        -9.636226616668008
      ],
      [
        "raise",
        -9.648656122509156
      ],
      [
        "receive",
        -9.667359400822065
      ],
      [
        "get",
        -9.671019774610478
      ],
      [
        "camera",
        -9.692355576211998
      ],
      [
        "usual",
        -9.692820339774755
      ],
      [
        "pensi",
        -9.70185030880496
      ],
      [
        "inc",
        -9.708259265578468
      ],
      [
        "ch",
        -9.730069712813492
      ],
      [
        "er",
        -9.737436738578577
      ],
      [
        "al",
        -9.76429178321352
      ],
      [
        "ift",
        -9.767134686403171
      ],
      [
        "nch",
        -9.770048439784091
      ],
      [
        "able",
        -9.78073926541672
      ],
      [
        "ore",
        -9.784695201177126
      ],
      [
        "nce",
        -9.787320055310909
      ],
      [
        "000",
        -9.803615171194405
      ],
      [
        "rid",
        -9.809954248562907
      ],
      [
        "Y",
        -9.810510092820774
      ],
      [
        "has",
        -9.820293972512976
      ],
      [
        "ical",
        -9.834674116039873
      ],
      [
        "cent",
        -9.855367956546456
      ],
      [
        "pen",
        -9.858338521808928
      ],
      [
        "wi",
        -9.873302074028185
      ],
      [
        "Wh",
        -9.906771575565008
      ],
      [
        "ed",
        -9.914087684926745
      ],
      [
        "oun",
        -9.915864296863692
      ],
      [
        "bee",
        -9.91614684784835
      ],
      [
        "llie",
        -9.923406607342717
      ],
      [
        "shel",
        -9.934445685828909
      ],
      [
        "pri",
        -9.935945895811301
      ],
      [
        "ow",
        -9.944288147041405
      ],
      [
        "or",
        -9.976173771871167
      ],
      [
        "missi",
        -9.976327045209263
      ],
      [
        "Ro",
        -9.98942213208447
      ],
      [
        "servi",
        -10.007366100896927
      ],
      [
        "uppo",
        -10.010218214709916
      ],
      [
        "low",
        -10.010744802272725
      ],
      [
        "one",
        -10.040565268926636
      ],
      [
        "foot",
        -10.04793414382141
      ],
      [
        "bed",
        -10.058905967578035
      ],
      [
        "lecti",
        -10.059908251809652
      ],
      [
        "play",
        -10.069285477455658
      ],
      [
        "place",
        -10.073110327036503
      ],
      [
        "ble",
        -10.10491277631464
      ],
      [
        "unc",
        -10.125987622969472
      ],
      [
        "earl",
        -10.132035087420203
      ],
      [
        "lon",
        -10.148357065465136
      ],
      [
        "on",
        -10.15602957843951
      ],
      [
        "cho",
        -10.162117460788117
      ],
      [
        "ate",
        -10.198019540202573
      ],
      [
        "of",
        -10.212576045197435
      ],
      [
        "ull",
        -10.252476903113006
      ],
      [
        "off",
        -10.258798994377035
      ],
      [
        "end",
        -10.279708285034538
      ],
      [
        "ging",
        -10.281713149201142
      ],
      [
        "ax",
        -10.284058656648941
      ],
      [
        "ic",
        -10.288138254186688
      ],
      [
        "ly",
        -10.29789301348648
      ],
      [
        "hal",
        -10.301278162535928
      ],
      [
        "wha",
        -10.301633938030726
      ],
      [
        "ome",
        -10.32242044390654
      ],
      [
        "mpl",
        -10.335650097310165
      ],
      [
        "Th",
        -10.335882849423001
      ],
      [
        "Ch",
        -10.351091513277273
      ],
      [
        "An",
        -10.359607367477892
      ],
      [
        "pro",
        -10.370608786316003
      ],
      [
        "once",
        -10.37645241742802
      ],
      [
        "put",
        -10.379298325244111
      ],
      [
        "vit",
        -10.467387104619295
      ],
      [
        "mak",
        -10.479127287180717
      ],
      [
        "ctiv",
        -10.494366045300607
      ],
      [
        "she",
        -10.495445576133271
      ],
      [
        "diti",
        -10.50142431500585
      ],
      [
        "mu",
        -10.518749787130883
      ],
      [
        "pl",
        -10.54566908720663
      ],
      [
        "use",
        -10.558524698201847
      ],
      [
        "Ma",
        -10.56816994100496
      ],
      [
        "high",
        -10.588507716826463
      ],
      [
        "tak",
        -10.63493018220371
      ],
      [
        "stea",
        -10.636630710807577
      ],
      [
        "tion",
        -10.681842757558131
      ],
      [
        "our",
        -10.682454534233393
      ],
      [
        "thr",
        -10.684748691481824
      ],
      [
        "icki",
        -10.686981679323223
      ],
      [
        "butt",
        -10.702835604595734
      ],
      [
        "eigh",
        -10.716139363559671
      ],
      [
        "cu",
        -10.717746465207767
      ],
      [
        "ma",
        -10.735567912301555
      ],
      [
        "eed",
        -10.737367322348303
      ],
      [
        "stic",
        -10.738506284291631
      ],
      [
        "urs",
        -10.743442472677813
      ],
      [
        "exp",
        -10.762704026221808
      ],
      [
        "re",
        -10.76410601496434
      ],
      [
        "ear",
        -10.772005641430976
      ],
      [
        "inte",
        -10.787274809274027
      ],
      [
        "up",
        -10.78774164044506
      ],
      [
        "be",
        -10.79476452811273
      ],
      [
        "flo",
        -10.799117925518338
      ],
      [
        "receiv",
        -10.802454198503206
      ],
      [
        "ring",
        -10.824132766824784
      ],
      [
        "nal",
        -10.835589096458827
      ],
      [
        "rea",
        -10.842456904247324
      ],
      [
        "es",
        -10.866510181847003
      ],
      [
        "pe",
        -10.898079070174129
      ],
      [
        "ppl",
        -10.900940492676614
      ],
      [
        "ha",
        -10.91303886874
      ],
      [
        "imu",
        -10.915895039237752
      ],
      [
        "Ca",
        -10.918853714041635
      ],
      [
        "nger",
        -10.935365630201156
      ],
      [
        "han",
        -10.949268489947162
      ],
      [
        "Vi",
        -10.951592123610641
      ],
      [
        "sum",
        -10.96530994221061
      ],
      [
        "rac",
        -10.990038956733187
      ],
      [
        "as",
        -11.003748434776089
      ],
      [
        "at",
        -11.011594733967724
      ],
      [
        "whi",
        -11.025327432942856
      ],
      [
        "le",
        -11.030506703972707
      ],
      [
        "unt",
        -11.04071035379846
      ],
      [
        "col",
        -11.040962638295833
      ],
      [
        "olli",
        -11.04327262731342
      ],
      [
        "Jo",
        -11.067763871321748
      ],
      [
        "ex",
        -11.07295690763644
      ],
      [
        "wor",
        -11.078276282322179
      ],
      [
        "tal",
        -11.08986816441313
      ],
      [
        "bra",
        -11.091019850669053
      ],
      [
        "irs",
        -11.102269680430869
      ],
      [
        "dri",
        -11.103145469802389
      ],
      [
        "ou",
        -11.108471616615372
      ],
      [
        "st",
        -11.11313198953301
      ],
      [
        "hi",
        -11.124022400376035
      ],
      [
        "ark",
        -11.153914446835406
      ],
      [
        "av",
        -11.17860819752509
      ],
      [
        "fro",
        -11.186913014212475
      ],
      [
        "button",
        -11.189831471171356
      ],
      [
        "co",
        -11.232679095420124
      ],
      [
        "res",
        -11.242890827120313
      ],
      [
        "mo",
        -11.263689168898251
      ],
      [
        "sale",
        -11.269287607835357
      ],
      [
        "ead",
        -11.271476824021558
      ],
      [
        "als",
        -11.277518052825695
      ],
      [
        "pla",
        -11.318354604748816
      ],
      [
        "ak",
        -11.3392004908623
      ],
      [
        "ine",
        -11.345538467005227
      ],
      [
        "sel",
        -11.358396903857813
      ],
      [
        "stu",
        -11.359823005588144
      ],
      [
        "pin",
        -11.362286919633739
      ],
      [
        "ust",
        -11.362625886138378
      ],
      [
        "hic",
        -11.371781192204887
      ],
      [
        "ke",
        -11.372603626445567
      ],
      [
        "ain",
        -11.376504419855111
      ],
      [
        "enc",
        -11.383879357222288
      ],
      [
        "clu",
        -11.395934684193644
      ],
      [
        "sticker",
        -11.417801647709718
      ],
      [
        "fo",
        -11.426161785039197
      ],
      [
        "q",
        -11.427586481285156
      ],
      [
        "came",
        -11.436611559827014
      ],
      [
        "is",
        -11.437173458027061
      ],
      [
        "im",
        -11.467936748881687
      ],
      [
        "rest",
        -11.470337145425482
      ],
      [
        "bo",
        -11.472485746075968
      ],
      [
        "to",
        -11.494461755187562
      ],
      [
        "mb",
        -11.51129471938123
      ],
      [
        "par",
        -11.538704171851833
      ],
      [
        "kin",
        -11.542809794054953
      ],
      [
        "z",
        -11.555397252137569
      ],
      [
        "bl",
        -11.555588084031303
      ],
      [
        "sho",
        -11.562836732825001
      ],
      [
        "app",
        -11.591704683554745
      ],
      [
        "Je",
        -11.595981350677192
      ],
      [
        "rien",
        -11.596056958256128
      ],
      [
        "uc",
        -11.617094949268676
      ],
      [
        "ut",
        -11.62623838875791
      ],
      [
        "ar",
        -11.632709662273548
      ],
      [
        "ous",
        -11.639417291742696
      ],
      [
        "ck",
        -11.650418187725538
      ],
      [
        "thi",
        -11.651014063362386
      ],
      [
        "arn",
        -11.684836966343344
      ],
      [
        "ho",
        -11.687462691037654
      ],
      [
        "tter",
        -11.709510393630724
      ],
      [
        "out",
        -11.72009670450223
      ],
      [
        "go",
        -11.732340673425313
      ],
      [
        "pisode",
        -11.752914217958493
      ],
      [
        "il",
        -11.753314401334551
      ],
      [
        "mea",
        -11.754329182690583
      ],
      [
        "pac",
        -11.765365070043941
      ],
      [
        "ol",
        -11.76751199496952
      ],
      [
        "tring",
        -11.784462696969898
      ],
      [
        "ale",
        -11.785051381661827
      ],
      [
        "iv",
        -11.79171329311739
      ],
      [
        "gu",
        -11.794226893341673
      ],
      [
        "om",
        -11.805604477904836
      ],
      [
        "ste",
        -11.82509095728989
      ],
      [
        "bec",
        -11.829957371161266
      ],
      [
        "rad",
        -11.836288996769524
      ],
      [
        "ever",
        -11.843483805331264
      ],
      [
        "ri",
        -11.84790381210486
      ],
      [
        "car",
        -11.852518324798389
      ],
      [
        "ami",
        -11.859341257324846
      ],
      [
        "tart",
        -11.87283229545692
      ],
      [
        "wan",
        -11.883654081879351
      ],
      [
        "un",
        -11.884083019241807
      ],
      [
        "tur",
        -11.888515330516336
      ],
      [
        "kie",
        -11.889855249336442
      ],
      [
        "ers",
        -11.892828979325744
      ],
      [
        "mal",
        -11.895157287422958
      ],
      [
        "Su",
        -11.904034878422525
      ],
      [
        "ica",
        -11.916340577714676
      ],
      [
        "it",
        -11.923030824383519
      ],
      [
        "bro",
        -11.924412664450251
      ],
      [
        "pai",
        -11.9244585631523
      ],
      [
        "str",
        -11.956019498417133
      ],
      [
        "ne",
        -11.958023186921967
      ],
      [
        "nth",
        -11.965980649305628
      ],
      [
        "lin",
        -11.969488394785605
      ],
      [
        "orm",
        -11.988798465214051
      ],
      [
        "ere",
        -11.994580761952879
      ],
      [
        "ort",
        -12.015315034455494
      ],
      [
        "les",
        -12.045126318595326
      ],
      [
        "emb",
        -12.045996092304186
      ],
      [
        "br",
        -12.093779846144153
      ],
      [
        "wat",
        -12.096650696431062
      ],
      [
        "us",
        -12.102169441036807
      ],
      [
        "ca",
        -12.104649832593122
      ],
      [
        "rou",
        -12.105152236549003
      ],
      [
        "bi",
        -12.113770490400533
      ],
      [
        "ge",
        -12.115765993836785
      ],
      [
        "lvi",
        -12.165725420127599
      ],
      [
        "ea",
        -12.182774938076326
      ],
      [
        "ay",
        -12.197916086871682
      ],
      [
        "te",
        -12.214560598025471
      ],
      [
        "um",
        -12.230525596553738
      ],
      [
        "ce",
        -12.231374295615659
      ],
      [
        "air",
        -12.232409305799013
      ],
      [
        "spe",
        -12.23477690148944
      ],
      [
        "ual",
        -12.236628535091056
      ],
      [
        "las",
        -12.2446947537855
      ],
      [
        "lv",
        -12.253710807638244
      ],
      [
        "He",
        -12.287549411797556
      ],
      [
        "To",
        -12.288023122670886
      ],
      [
        "owl",
        -12.306333925692044
      ],
      [
        "eat",
        -12.319150358181082
      ],
      [
        "hor",
        -12.319350182202378
      ],
      [
        "ile",
        -12.32865743420123
      ],
      [
        "ur",
        -12.329756551821038
      ],
      [
        "hers",
        -12.342299819950945
      ],
      [
        "ime",
        -12.352237820390812
      ],
      [
        "fee",
        -12.353210649018866
      ],
      [
        "Da",
        -12.35857873192244
      ],
      [
        "est",
        -12.362792140805235
      ],
      [
        "ivi",
        -12.363024711815047
      ],
      [
        "vie",
        -12.389683069764
      ],
      [
        "en",
        -12.407609611269772
      ],
      [
        "oth",
        -12.412407261074955
      ],
      [
        "lo",
        -12.43046520011696
      ],
      [
        "fi",
        -12.444479574436814
      ],
      [
        "icke",
        -12.45105390965834
      ],
      [
        "ebr",
        -12.454246488831625
      ],
      [
        "nc",
        -12.474287579297531
      ],
      [
        "We",
        -12.484235237039416
      ],
      [
        "am",
        -12.49454830817922
      ],
      [
        "di",
        -12.514307712068561
      ],
      [
        "unce",
        -12.558359207133869
      ],
      [
        "teak",
        -12.591159343189016
      ],
      [
        "econd",
        -12.598334043478825
      ],
      [
        "ubl",
        -12.606474123067567
      ],
      [
        "ost",
        -12.607572242807208
      ],
      [
        "und",
        -12.627700001760958
      ],
      [
        "asse",
        -12.636425057878373
      ],
      [
        "hird",
        -12.638536755854522
      ],
      [
        "ac",
        -12.642743635169122
      ],
      [
        "op",
        -12.645598462822713
      ],
      [
        "nni",
        -12.645775493590902
      ],
      [
        "ra",
        -12.656746863102558
      ],
      [
        "id",
        -12.658513070036923
      ],
      [
        "are",
        -12.662065036406068
      ],
      [
        "eng",
        -12.671242976931211
      ],
      [
        "ora",
        -12.696251373644875
      ],
      [
        "wa",
        -12.699745578775852
      ],
      [
        "mp",
        -12.701132389089691
      ],
      [
        "pend",
        -12.704093082893767
      ],
      [
        "ser",
        -12.721721038190143
      ],
      [
        "me",
        -12.728426190755895
      ],
      [
        "tamp",
        -12.778442775186036
      ],
      [
        "whe",
        -12.780905856748216
      ],
      [
        "top",
        -12.781364866492888
      ],
      [
        "hark",
        -12.782009460044554
      ],
      [
        "ant",
        -12.783699409343741
      ],
      [
        "now",
        -12.785944063010804
      ],
      [
        "nds",
        -12.79802891176246
      ],
      [
        "tho",
        -12.805428999962887
      ],
      [
        "era",
        -12.807018664938411
      ],
      [
        "ame",
        -12.814130027143072
      ],
      [
        "ag",
        -12.833281100731488
      ],
      [
        "llo",
        -12.83405573690263
      ],
      [
        "ters",
        -12.843722055038612
      ],
      [
        "se",
        -12.84374494464572
      ],
      [
        "pi",
        -12.8465388696246
      ],
      [
        "eal",
        -12.850115793867268
      ],
      [
        "sto",
        -12.852384290642483
      ],
      [
        "ir",
        -12.856316708698984
      ],
      [
        "rie",
        -12.878946280789636
      ],
      [
        "hua",
        -12.88726309673093
      ],
      [
        "wh",
        -12.902549062412898
      ],
      [
        "ons",
        -12.909279743209108
      ],
      [
        "gh",
        -12.910476640444406
      ],
      [
        "Fo",
        -12.911442496975361
      ],
      [
        "bb",
        -12.916660227240145
      ],
      [
        "win",
        -12.946266710649024
      ],
      [
        "uns",
        -12.95172987440424
      ],
      [
        "lar",
        -12.953207556815855
      ],
      [
        "erving",
        -12.964349889892077
      ],
      [
        "sta",
        -12.964838115549059
      ],
      [
        "eak",
        -12.970505465508992
      ],
      [
        "tea",
        -12.9794546240205
      ],
      [
        "fin",
        -12.989126586043266
      ],
      [
        "lit",
        -12.994398391715015
      ],
      [
        "rin",
        -12.995444220976992
      ],
      [
        "ermi",
        -13.023649591986437
      ],
      [
        "ry",
        -13.039872175602031
      ],
      [
        "wo",
        -13.041233905827477
      ],
      [
        "oes",
        -13.062409783030688
      ],
      [
        "sea",
        -13.064024502625127
      ],
      [
        "ini",
        -13.069079009419088
      ],
      [
        "ti",
        -13.077140923474197
      ],
      [
        "ok",
        -13.08691688303169
      ],
      [
        "eacher",
        -13.089354838793655
      ],
      [
        "we",
        -13.090609318327044
      ],
      [
        "rth",
        -13.097259947768993
      ],
      [
        "son",
        -13.098123821300351
      ],
      [
        "ken",
        -13.101089643717167
      ],
      [
        "few",
        -13.10340843659866
      ],
      [
        "ot",
        -13.119504611852252
      ],
      [
        "vi",
        -13.128720847493227
      ],
      [
        "lli",
        -13.131714361827079
      ],
      [
        "ues",
        -13.135918416930103
      ],
      [
        "ffe",
        -13.172712135866771
      ],
      [
        "la",
        -13.181901207276296
      ],
      [
        "upp",
        -13.206675066217125
      ],
      [
        "lie",
        -13.218464147515203
      ],
      [
        "rs",
        -13.218956504143922
      ],
      [
        "rder",
        -13.228151415795121
      ],
      [
        "new",
        -13.244526405008385
      ],
      [
        "had",
        -13.258176374651939
      ],
      [
        "fic",
        -13.270875181173801
      ],
      [
        "ind",
        -13.279502509241407
      ],
      [
        "nde",
        -13.28582224039458
      ],
      [
        "De",
        -13.29845256979868
      ],
      [
        "lea",
        -13.298533566201254
      ],
      [
        "ras",
        -13.29979892007395
      ],
      [
        "ast",
        -13.303825320092116
      ],
      [
        "ina",
        -13.311610207523879
      ],
      [
        "lass",
        -13.32935095649819
      ],
      [
        "ria",
        -13.35295392331369
      ],
      [
        "if",
        -13.365070385451855
      ],
      [
        "ld",
        -13.37490308129276
      ],
      [
        "wal",
        -13.390488472625798
      ],
      [
        "nt",
        -13.400786832548212
      ],
      [
        "arl",
        -13.41973470154291
      ],
      [
        "do",
        -13.423449020419893
      ],
      [
        "el",
        -13.437447586145243
      ],
      [
        "llow",
        -13.449092767635895
      ],
      [
        "ock",
        -13.450990648049277
      ],
      [
        "tuff",
        -13.462723454456459
      ],
      [
        "urn",
        -13.479340489585276
      ],
      [
        "ad",
        -13.479740906326052
      ],
      [
        "pee",
        -13.485193083651964
      ],
      [
        "eous",
        -13.488490452936482
      ],
      [
        "pr",
        -13.493547497376511
      ],
      [
        "ee",
        -13.526497051221435
      ],
      [
        "ik",
        -13.537458235260559
      ],
      [
        "nes",
        -13.543152656705765
      ],
      [
        "sh",
        -13.55022003309932
      ],
      [
        "ache",
        -13.552500258853131
      ],
      [
        "ees",
        -13.574596169884611
      ],
      [
        "sod",
        -13.583450876196821
      ],
      [
        "ist",
        -13.584754854277634
      ],
      [
        "ig",
        -13.631135568675154
      ],
      [
        "It",
        -13.638782164002302
      ],
      [
        "ul",
        -13.665187523619185
      ],
      [
        "tor",
        -13.667694581406053
      ],
      [
        "ite",
        -13.668333597355415
      ],
      [
        "Ja",
        -13.706552406234252
      ],
      [
        "li",
        -13.71141794907144
      ],
      [
        "ont",
        -13.728703253664952
      ],
      [
        "far",
        -13.730798189757046
      ],
      [
        "ten",
        -13.76019980485575
      ],
      [
        "lla",
        -13.802004629961823
      ],
      [
        "mi",
        -13.824454995861538
      ],
      [
        "oda",
        -13.86577583018237
      ],
      [
        "che",
        -13.868908303224991
      ],
      [
        "iti",
        -13.907691578611637
      ],
      [
        "peci",
        -13.918243212966473
      ],
      [
        "len",
        -13.921733078058118
      ],
      [
        "gro",
        -13.926532712418659
      ],
      [
        "ni",
        -13.965298032905004
      ],
      [
        "coo",
        -13.974226655271014
      ],
      [
        "hel",
        -13.976140950308247
      ],
      [
        "xi",
        -13.990011232499741
      ],
      [
        "range",
        -13.992618830360078
      ],
      [
        "foo",
        -14.00973340610677
      ],
      [
        "rit",
        -14.011026265926414
      ],
      [
        "tri",
        -14.012779225299013
      ],
      [
        "ket",
        -14.033744166822235
      ],
      [
        "ien",
        -14.034441749104719
      ],
      [
        "chi",
        -14.037466343092033
      ],
      [
        "tch",
        -14.039907437219973
      ],
      [
        "ent",
        -14.049987334729247
      ],
      [
        "da",
        -14.059643822487251
      ],
      [
        "va",
        -14.072224768006738
      ],
      [
        "ye",
        -14.083174824441192
      ],
      [
        "nimal",
        -14.089201703926744
      ],
      [
        "alar",
        -14.09527598964115
      ],
      [
        "rlie",
        -14.100750990482883
      ],
      [
        "ls",
        -14.114885395259634
      ],
      [
        "po",
        -14.145822901256661
      ],
      [
        "acc",
        -14.150786721388666
      ],
      [
        "fr",
        -14.156100730876194
      ],
      [
        "eep",
        -14.175290937106574
      ],
      [
        "ze",
        -14.176705712228426
      ],
      [
        "ord",
        -14.180629655636935
      ],
      [
        "oo",
        -14.187625097656506
      ],
      [
        "eturn",
        -14.195980857097464
      ],
      [
        "ide",
        -14.214668877151079
      ],
      [
        "tw",
        -14.214883601227353
      ],
      [
        "elp",
        -14.215103633373584
      ],
      [
        "pa",
        -14.230027679606069
      ],
      [
        "ki",
        -14.246721472728316
      ],
      [
        "ie",
        -14.259830811209804
      ],
      [
        "ase",
        -14.297376908881127
      ],
      [
        "inute",
        -14.306133482508892
      ],
      [
        "bid",
        -14.317595752860319
      ],
      [
        "ote",
        -14.318541958585538
      ],
      [
        "ttend",
        -14.343223595499001
      ],
      [
        "ru",
        -14.348074183654582
      ],
      [
        "art",
        -14.349561817266995
      ],
      [
        "lle",
        -14.353510730759488
      ],
      [
        "ta",
        -14.365555312426705
      ],
      [
        "hun",
        -14.368173831241911
      ],
      [
        "hicken",
        -14.377286460358619
      ],
      [
        "od",
        -14.387090448328665
      ],
      [
        "fun",
        -14.416480345980906
      ],
      [
        "ins",
        -14.463944768423982
      ],
      [
        "rtic",
        -14.47980668413851
      ],
      [
        "nis",
        -14.517860274296158
      ],
      [
        "ger",
        -14.535745094033647
      ],
      [
        "don",
        -14.54493059903799
      ],
      [
        "wee",
        -14.555607998447625
      ],
      [
        "et",
        -14.556676245410808
      ],
      [
        "olor",
        -14.564171296825322
      ],
      [
        "sma",
        -14.57748314889015
      ],
      [
        "ial",
        -14.591409880754007
      ],
      [
        "arton",
        -14.59844455535159
      ],
      [
        "row",
        -14.602037699364287
      ],
      [
        "ro",
        -14.607191034213681
      ],
      [
        "ori",
        -14.609258657294424
      ],
      [
        "tre",
        -14.643387712460633
      ],
      [
        "til",
        -14.689837106382258
      ],
      [
        "ran",
        -14.702924216743039
      ],
      [
        "sal",
        -14.738618703744661
      ],
      [
        "oge",
        -14.739639560467445
      ],
      [
        "dult",
        -14.756068358659004
      ],
      [
        "ft",
        -14.765726240695475
      ],
      [
        "ose",
        -14.77105722853622
      ],
      [
        "hin",
        -14.771886637121716
      ],
      [
        "riend",
        -14.805202796484597
      ],
      [
        "int",
        -14.807467966038365
      ],
      [
        "ett",
        -14.820473598299406
      ],
      [
        "edi",
        -14.83705507987728
      ],
      [
        "not",
        -14.838625858117467
      ],
      [
        "tay",
        -14.86086509193363
      ],
      [
        "leepwalk",
        -14.871813830729561
      ],
      [
        "rap",
        -14.88724039913292
      ],
      [
        "pu",
        -14.914867926511892
      ],
      [
        "sti",
        -14.945403594809664
      ],
      [
        "so",
        -14.948840338734652
      ],
      [
        "ip",
        -14.959948657090894
      ],
      [
        "min",
        -14.963681481290338
      ],
      [
        "em",
        -14.964001848803166
      ],
      [
        "andle",
        -14.98448568935719
      ],
      [
        "ecide",
        -14.990048159538155
      ],
      [
        "eek",
        -15.006527940553914
      ],
      [
        "leep",
        -15.011465313729488
      ],
      [
        "ba",
        -15.025643661514165
      ],
      [
        "see",
        -15.026671788349205
      ],
      [
        "ns",
        -15.045341876459975
      ],
      [
        "tle",
        -15.051134127658921
      ],
      [
        "nut",
        -15.062124776686733
      ],
      [
        "cal",
        -15.108165575781916
      ],
      [
        "nu",
        -15.158263618053727
      ],
